{
  "title": "FAQs",
  "option": {
    "general": "General",
    "register": "Registering a name",
    "manage": "Managing a name",
    "troubleshoot": "Troubleshooting"
  },
  "general": {
    "What is the maximum length of a name I can register?": "Names cannot be less than 3 characters. Wrapped names can only have labels as long as 256 bytes",
    "Can names have emojis?": "Yes!",
    "What happens if a name expires?": "After a name expires, there is a 90 day grace period in which the owner can't edit the records, but can still re-register the name. After this grace period, the name is released for registration by anyone with a temporary premium, which decreases over a 21 days period.<br/><br/>Expired names do not lose their records, so will continue resolving to their previous ETH address until a new owner overwrites it.",
    "Where can I see the list of names to be released?": "You can find a list at the _ENS Names to be released_ section of [the Dune Analytics dashboard](https://dune.xyz/makoto/ens-released-to-be-released-names).",
    "What is an ENS profile?": "ENS profiles are a collection of pre-defined records, which are used by other dApps. Creating your profile in ENS allows you to have a single source for your profile information across Web3.",
    "What is an ENS avatar?": "You can upload an image, or use an NFT as your ENS avatar. This will be pulled into dApps as your web3 avatar, while also updating your ENS NFT background.<br/><br/>To add an avatar click Edit Profile from the Profile tab of any name you own. NFT avatars must be an ERC721/ERC1155 NFT and have a valid image URI.",
    "Can I use an ENS name to point to my website?": "Though ENS can technically store anything, there aren't many third party tools and applications which resolve IP addresses attached to ENS.<br/><br/>Instead, we suggest hosting your static html/css/images on IPFS and put the hash in your ENS name's Content record. Then it can be resolved by ENS-aware browsers (e.g. Opera), browser extensions (Metamask), or any browser with \".link\" or \".limo\" appended to the end (e.g. vitalik.eth.link or vitalik.eth.limo).<br/><br/>If you want to redirect your ENS name to an existing website, you could write a html file containing JavaScript logic to redirect to your website, upload the file into ipfs using services like [IPFS Pinata](https://pinata.cloud/), then set the CID to your contenthash. See the source code of depositcontract.eth.limo as an example.",
    "I bought my name on an NFT marketplace, how do I use it?": "When you purchase an existing name it may come with existing records from the previous owner. To use it as your primary name, make sure to update the ETH records to match your ETH address and then update your primary name from the settings page.<br/><br/>Optionally, you can also remove or override existing records or create your own profile."
  },
  "register": {
    "Can I register names other than .eth?": "Yes! You can import any DNS name that has DNSSEC-enabled into ENS. Please refer to our [guide](https://docs.ens.domains/dns-registrar-guide) for more detail.",
    "How much does it cost to register a .eth name?": "Currently, registration costs are set at the following prices:<br/><ul><br/>  <li>5+ character .eth names: $5 in ETH per year.</li>  <li>4 character .eth names: $160 in ETH per year.</li>  <li>3 character .eth names $640 in ETH per year.</li></ul><br/>3 and 4 character names have 'premium' pricing to reflect the small number of these names available. Recently released names will also have a temporary premium.",
    "What is a temporary premium?": "If a name is recently released it will have a temporary premium to prevent squatters snatching names. To give fair opportunity, the premium starts at $100,000,000 and reduces to $0 over 21 days.",
    "I'm stuck during registration, what should I do?": "<ul><li>At step 1: If you sped up your transaction you will need to refresh the page, as the app cannot detect this.</li><li>At step 2: The countdown timer may take up to an additional minute to allow the blockchain to progress. If this continues for more than 5 minutes, please send us a [direct message on Twitter](https://twitter.com/ensdomains).<ul><li>Note that if you leave step 2 for more than 7 days your registration will reset and you will need to start again from step 1.</li></ul></li><li>At step 3: This step may fail when the USD price for a name changes and you haven't registered with enough ETH. Please try the transaction again.<ul><li>Note that if you leave step 3 for more than 24 hours your registration will reset and you will need to start again from step 1.</li></ul></li></ul>",
    "Is it safe to refresh or leave the page during registration?": "Yes, it is safe to refresh the page or close the browser once step 1 transaction is complete. However you cannot switch to different devices or machines because it needs a locally stored “secret” which will be used at step 3. Please also do not delete browser history during the registration.",
    "I cannot see my names in my wallet or NFT marketplaces": "Many wallets and sites fetch metadata from OpenSea and there may be delays when OpenSea is under heavy load.<br/><br/>As long as you can see your registered name under _Names_ when connected to the ENS app, or your ETH address in the name's records, your name is registered successfully.",
    "My new name already has records. Is this a bug?": "When names are transferred, resold, or released, they do not lose their existing records. It is safe to update or remove these records."
  },
  "manage": {
    "What records can I add? Is ENS only for storing an Ethereum address?": "You can store the addresses of over 100 blockchains, a content hash of a decentralized website, profile information such as an avatar and Twitter handle, and more. ENS even allows you to create custom records that can be used by other applications.",
    "What is a primary ENS name?": "A Primary ENS Name (previously Reverse Record) points your Ethereum address to an ENS name. This allows dApps to find and display your ENS name when you connect to them with your Ethereum account. You can only have one primary name per address.<br/><br/>Sending money to an ENS name will resolve to the eth address record, and is not dependent on having a primary name set. However, your primary name must match your Ethereum address record.<br/><br/>To set or change your primary name, visit the settings page in the ENS app.",
    "How do I set up my profile?": "ENS profiles are a collection of pre-defined records, which are used by other dApps. When connected to the ENS app and viewing a name you own, you will see an _Edit Profile_ button on the _Profile_ tab. Here you can update the specific records used for profiles.",
    "What are Managers and Owners?": "The Owner is the ultimate owner of the name. For .eth names the Owner (formerly Registrant) of a name can change the Manager and transfer ownership. Not all names will have an owner. If you have PARENT_CANNOT_CONTROL burned as a subname, you will be considered the owner as the parent cannot take over your name.<br/><br/>The Manager (formerly Controller) of a name can change the resolver and add/edit records. Some dApps (eg: Fleek, OpenSea) set themselves as Manager so they can update records on your behalf. If your .eth name is wrapped, you will not have a Manager as these ownerships are now combined under just a single owner.",
    "How do I send my name to another address?": "Sending your name to another address will let you transfer the Owner, Manager or both to a new Ethereum address. This can be done from the _More_ tab when viewing a name you own.<br/><br/>Sending the name to another address will not update the records, or make it the primary name for the new address.",
    "What is a Resolver?": "A Resolver is a smart contract that holds records. By default, names are set to the Public Resolver, which is developed and maintained by the ENS team and has all the standard ENS record types. This is recommended for most users, but you can use custom contracts if you'd like.<br/><br/>If you are using an older version of the resolver, you can upgrade it from within the ENS app in the More tab.",
    "What is the Name Wrapper?": "Wrapping a name is an upgrade that gives older names access to more modern features, such as burnable permissions and ERC1155 NFT support. All newly registered names are wrapped by default.<br/><br/>If you do have an unwrapped name you will see a prompt to upgrade in the ENS app. This is of course optional, and your name will still work without it.<br/><br/>You can view a full list of feature [on Github](https://github.com/ensdomains/ens-contracts/tree/master/contracts/wrapper).",
    "How do I find the labelhash/namehash of a name?": "Please refer to our [developer documentation page.](https://docs.ens.domains/contract-api-reference/name-processing#how-do-i-find-the-labelhash-namehash-of-a-name)",
    "What is the difference between a name and a subname?": "Both are names, however subnames have a parent name. For example with resolver.ens.eth, ens.eth is the name while resolver is the subname.<br/><br/>Subnames usually inherit the permissions of the parent name, however parent name owners can burn their permissions, giving subnames more control.",
    "What are permissions?": "Permissions allow the owner of a parent name to remove their access to certain features on subnames. For example, by default only the parent name owner can transfer ownership of a subname. With permissions, the parent name owner can remove their ability to do so, allowing trustless subnames. Before burning any permissions, the name must first burn the ability to unwrap and the wrapper expiry must not be expired."
  },
  "troubleshoot": {
    "How can I receive an extension reminder?": "",
    "Why are some of my names shown as a jumble of characters?": "Names are stored as a hash on-chain that are then decoded using a list of possible names. If it cannot be matched to a name you will instead see the hash.<br/><br/>You can still access and manage the name if you search for the name directly in the search bar.",
    "I lost access to the Ethereum account that owns a name I registered. Can I still extend its registration period?": "Any Ethereum account can pay to extend the registration of any ENS name, though doing so will not change ownership of the name.",
    "How do I unregister my name?": "Names cannot be unregistered until they expire and their grace period runs out. However, there are some steps that can be taken to remove functionality or ownership.<br/><br/>- Removing your address records means that people can no longer look up your address with the name.<br/>- You can remove a primary name from settings.<br/>- You can transfer ownership to a burn address (eg: 0x0000…dead).<br/><br/>Keep in mind that nothing can erase the fact that you owned a name in the past as it is all on chain. Names will also become available for registration again, once they expire.",
    "I registered names before 2019 May. Can I have my deposit back?": "Yes, you can get your deposit back from[ reclaim.ens.domains](https://reclaim.ens.domains/) whether you extended the registration of the name or not.<br/><br/>Please remember that the amount you will receive is the amount of the second-highest bidder (unless you were the only bidder). For example, if you bid 1 ETH and the second highest bidder bid 0.1 ETH, you deposited 0.1 ETH and you have already received the remaining (0.9 ETH) when you finailsed the auction. Therefore you can now only reclaim 0.1 ETH back. Please read the[ the initial guide back in 2017](https://medium.com/the-ethereum-name-service/a-beginners-guide-to-buying-an-ens-domain-3ccac2bdc770) for more detail.",
    "How can I get more support?": "To get in touch with us send a [direct message on Twitter](https://twitter.com/ensdomains). This is the best place for any support questions.<br/><br/>You can also join our community through [Discord](https://chat.ens.domains/) or the [DAO Governance forums](https://discuss.ens.domains/). For technical information you can [visit our documentation](https://docs.ens.domains/)."
  }
}
